mold_ver_002/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topPatch
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }

    inletPatch
    {
        type            fixedValue;
        value           uniform (0 0 100);
    }

    fixedWalls
    {
        type            noSlip;
    }

    nozzlePatch
    {
        type            noSlip;
    }
    
    topOutflowPatch
    {
        type            zeroGradient;
    }

    bottomOutflowPatch
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
