mold_ver_002/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-50 -50 0)
    (110 -50 0)
    (110 110 0)
    (-50 110 0)
    (-50 -50 1000)
    (110 -50 1000)
    (110 110 1000)
    (-50 110 1000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 160) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topPatch
    {
        type patch;
        faces
        (
           (3 2 1 0)
        );

    }


    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 3 7 6)
            (1 2 6 5)
            (4 0 1 5)
        );
    }
    
    bottomOutflowPatch
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
