mold_ver_002/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    nozzlePatch;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
           name mold;
        }
    }

    {
        name    topPatch;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
           name topPatch;
        }
    }

    {
        name    out_cylinder;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
           p1 (30.0 30.0 0);
           p2 (30.0 30.0 90.0);
           radius 30.0;
        }
    }

    {
        name    inner_cylinder;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
           p1 (30.0 30.0 0);
           p2 (30.0 30.0 90.0);
           radius 25.0;
        }
    }

   {
        name    top_negative;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
           box (-50 -50 0.01) (110 110 1000);
        }
    }


//new faceSet
       
     {
        name    inletPatch;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
           set inner_cylinder;
           option all;
        }
    }
    
   {
        name    inletPatch;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
           set top_negative;
        }
    }

//new patch

    {
        name    topOutflowPatch;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {
           set topPatch;
        }
    }
   
   {
        name    out_cylinder;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
           set out_cylinder;
           option all;
        }
    }
    

    {
        name    topOutflowPatch;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
           set out_cylinder;
        }
    }

);

// ************************************************************************* //
